# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'getantibody/tap/antibody' # ZSH Plugin Manager
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'imagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'

# Apps
cask 'aerial'
cask 'caffeine'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'hyper'
cask 'insomnia'
cask 'java'
cask 'mysqlworkbench'
cask 'phpstorm'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'there'
cask 'transmit'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas '1Password', id: 1333542190
mas 'Keynote', id: 409183694
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'WhatsApp', id: 1147396723 
