# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'htop'
brew 'youtube-dl'
brew 'rsync'
brew 'yarn'

# Development
brew 'php'
brew 'composer'

# Apps
cask 'aerial'
cask 'firefox'
cask 'google-chrome'
cask 'hyper'
cask 'phpstorm'
cask 'sequel-pro'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'iterm2'
cask 'transmit'
cask 'tower'
cask 'proxyman'
cask 'dbngin'
cask 'tinkerwell'
cask 'querious'
cask 'missive'
cask 'notion'
cask 'spotify'
cask '1password'
cask '1password-cli'
cask 'docker'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'WhatsApp', id: 1147396723
mas 'Speedtest', id: 1153157709
mas 'Bear', id: 1091189122
mas 'Moom', id: 419330170
